tap "localstack/tap"
brew "python@3.13"
brew "aws-sam-cli"
brew "awscli"
brew "bash"
brew "codex"
brew "coreutils"
brew "docker-credential-helper"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnu-time"
brew "ipython"
brew "mas"
brew "neovim"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "ruby"
brew "scrcpy"
brew "temporal"
brew "zoxide"
brew "localstack/tap/localstack-cli"
cask "1password-cli"
cask "android-studio"
cask "dbeaver-community"
cask "font-geist-mono-nerd-font"
cask "font-noto-sans-mono-cjk-sc"
cask "gimp"
cask "http-toolkit"
cask "jdownloader"
cask "nosql-workbench"
cask "rancher"
cask "session-manager-plugin"
cask "warp"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "boto3typed.boto3-ide"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "meta.pyrefly"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
